/// <summary>
/// 装备类型
/// </summary>
public enum EquipTypeList
{
     武器,
     衣服,
     头盔,
     项链,
     护臂,
     戒指,
     手镯,
     扳指,
     腰带,
     靴子,
     护符,
     灵宝,
     勋章,
     饰品,
     玉佩,
     披风
       
}

public enum EquipConfigTypeList
{
    武器,
    衣服,
    头盔,
    项链,
    护臂,
    戒指,
    手镯,
    扳指,
    腰带,
    靴子,
    护符,
    灵宝,
    勋章,
    饰品,
    玉佩,
    披风,
    翅膀,
    秘笈,
    材料,
    宠物蛋,
    宠物技能,
    消耗品,
    战斗技能,
    特殊技能,
    炼丹材料,
    配方,
    丹药,
    秘籍,
    魔装武器,
    神器
}