

public enum enum_attribute_list 
{
    生命值=0,
    法力值,
    内力值,
    蓄力值,
    物理防御,
    魔法防御,
    物理攻击,
    魔法攻击,
    生命回复,
    法力回复,
    命中,
    躲避,
    穿透,
    格挡,
    暴击,
    幸运,
    真实伤害,
    伤害减免,
    异常抗性,
    暴击伤害,
    伤害加成,
    伤害吸收,
    攻击速度,
    移动速度,
    生命加成,
    法力加成,
    物攻加成,
    魔攻加成,
    物防加成,
    魔防加成,
}

public enum enum_skill_attribute_list
{
    生命值,
    法力值,
    内力值,
    蓄力值,
    物理防御,
    魔法防御,
    物理攻击,
    魔法攻击,
    生命回复,
    法力回复,
    命中,
    躲避,
    穿透,
    格挡,
    暴击,
    幸运,
    真实伤害,
    伤害减免,
    异常抗性,
    暴击伤害,
    伤害加成,
    伤害吸收,
    攻击速度,
    移动速度,
    生命加成,
    法力加成,
    物攻加成,
    魔攻加成,
    物防加成,
    魔防加成,
    土属性强化,// 201  
    火属性强化,//202
    水属性强化,// 203
    木属性强化,//204
    金属性强化,//205
    体质,

    经验加成 =100, //100
    装备掉落,//101
    极品宠物掉落,// 102
    人物历练,// 103
    宠物经验,// 104
    内功经验,// 105
    灵珠收益,// 106
    装备爆率,// 107
    宠物获取,// 108
    云游商人折扣,// 109 
    祈愿收益,// 110
    奇遇任务收益,// 111
    游历危险躲避率,// 112
    游历双倍获得率,// 113
    游历时长,// 114
    游历龙珠收益,// 115
    寻怪间隔,// 116
    宠物容量,//117

    土=201,// 201
    火,//202
    水,// 203
    木,//204
    金,//205
    五行伤害,// 206
    五行伤害减少,// 207
    灵力,// 208
    体魄,// 209
    神识,// 210

    宠物攻击 =301,// 301
    宠物防御,// 302
    宠物生命,// 303
    宠物暴击,// 304

    宠物暴击伤害,// 305
    宠物暴击率,// 306
    宠物攻击速度,// 307


    技能伤害=401,// 401
    燃血,// 攻击时5%概率消耗10%当前hp增加90%技能伤害 402
    灵身,// 被攻击时5%概率躲避伤害 403
    连击,// 攻击时2%概率增加1倍伤害 404
    受到减免伤害,// 405
    复活次数,// 406
    幸运一击的概率,// 407
    幸运一击的伤害,// 408
    攻击时概率抵消伤害,// 409
    被攻击时反击真实伤害,// 410
    每次攻击增加伤害,// 411

    治疗术效果=501,// 501
    施毒术效果,//502
    青云门技能伤害,// 503 
    魔法盾效果,// 504
    血刀刀法伤害,// 505
    鞭尸概率,//506
    无视防御,//507
    灵气上限,//508
    空白,//509
    攻击回血,//510
    攻击回蓝,//511
    最终伤害,//512
    物品双倍掉落概率,//513
    吐纳经验,//514
    法宝匣数量,//515
    厚土大法技能伤害,//516
    蛊毒大法技能伤害,//517
    血河大法技能伤害,//518
    复活,//519
    强化费用,//520
    离线间隔,//521
    签到收益,//522
    月卡,//523
    至尊卡,//524
    试练塔积分,//525
    攻击吸血,
    攻击吸蓝,
}
/// <summary>
/// 武器展示效果
/// </summary>
public enum enum_equip_show_list
{ 
降低对方防御=1,
暴击伤害,
双倍打击概率,
中毒概率,
麻痹概率,
释放火球分身概率,
}

