using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public enum enum_talent_offect_list
{

    生命=100,
    攻击=101,
    魔法=102,
    道术=103,
    防御=104,
    攻击速度=106,
    物理攻击=107,
    魔法攻击=108,
    道术攻击=109,
    防御值=110,
    躲避=111,
    //速度=112,
    命中=113,
    技能=200,
    附加攻击=201,
    附加魔法=202,
    附加道术=203,
    附加双防=204,
    附加伤害=205,
    附加回血=206,
    附加攻击范围=207,
    无视防御=208,
    召唤兽=300,
    召唤兽攻击=301,
    召唤兽生命=302,
    召唤兽防御=303,
    召唤兽速度=304,
    召唤兽死亡爆炸=305,
    特殊效果=400,
    临时伤害=401,
    临时防御 = 402,
    临时速度 = 403,
    单体改群体=500,
    技能攻击个数=600,
    技能概率不消耗蓝=601,
    技能全体伤害=602,
    群体技能攻击范围=603,
    每秒回复全体血量百分比=604,
    攻击击退敌人概率=605,
    弹道=1000

    /*
    * /// 100属性 生命百分比
   /// 101攻击百分比
   /// 102魔法百分比
   /// 103道术百分比
   /// 104防御百分比
   /// 106攻击速度百分比
   /// 
   /// 107 攻击
   /// 108 魔法
   /// 109 道术
   /// 110 防御
   /// 111 躲避
   /// 112 速度
   /// 113 命中
   /// 200技能
   /// 201 技能附加攻击 跟等级走
   /// 202 技能附加魔法 跟等级走
   /// 203 技能附加道术 跟等级走
   /// 204 技能附加双防御 
   /// 205 技能附加伤害
   /// 206 技能附加回血
   /// 207 技能附加攻击范围
   /// 208 无视防御
   /// 300召唤兽
   /// 301召唤兽攻击 跟着道术走
   /// 302召唤兽生命 跟着道术走
   /// 
   /// 303召唤兽防御 跟着道术走
   /// 304召唤兽速度
   /// 305召唤兽死亡爆炸
   /// 400特殊效果 buff本源
   /// 401伤害 
   /// 402防御
   /// 403 速度
   /// 500 单体改群体
   /// 特殊效果
   /// 600 技能攻击个数
   /// 601 技能概率不消耗蓝
   /// 602 技能全体伤害
   /// 603 群体技能攻击范围
   /// 604 每s回复全体血量百分比
   /// 605 攻击击退敌人概率
   /// 
    */

}
